{"heuristic": 366, "pairing": 484, "assessment": 16, "smoked": 679, "sausage": 647, "syrah": 746, "shiraz": 674, "heuristic pairing": 367, "pairing assessment": 485, "assessment smoked": 35, "smoked sausage": 680, "sausage syrah": 652, "syrah shiraz": 747, "charcuterie": 128, "board": 54, "grenache": 348, "assessment charcuterie": 21, "charcuterie board": 129, "board grenache": 57, "acidic": 2, "wine": 812, "balances": 44, "food": 304, "lemon": 410, "tart": 765, "madeira": 421, "acidic wine": 4, "wine balances": 813, "balances acidic": 45, "acidic food": 3, "food lemon": 308, "lemon tart": 411, "tart madeira": 769, "tannic": 760, "red": 544, "complements": 183, "meat": 425, "fat": 265, "roast": 601, "lamb": 378, "cabernet": 107, "sauvignon": 655, "tannic red": 761, "red complements": 545, "complements red": 184, "red meat": 546, "meat fat": 427, "fat roast": 267, "roast lamb": 603, "lamb cabernet": 381, "cabernet sauvignon": 108, "duck": 261, "orange": 465, "viognier": 807, "assessment duck": 25, "duck orange": 262, "orange viognier": 471, "citrus": 177, "salad": 605, "pinot": 500, "noir": 446, "food citrus": 305, "citrus salad": 178, "salad pinot": 622, "pinot noir": 501, "crisp": 225, "acidity": 5, "suits": 735, "seafood": 667, "oysters": 474, "albariño": 11, "crisp acidity": 226, "acidity suits": 6, "suits seafood": 737, "seafood oysters": 670, "oysters albariño": 475, "sangiovese": 646, "salad sangiovese": 626, "cheese": 131, "platter": 503, "assessment cheese": 22, "cheese platter": 149, "platter pinot": 520, "grüner": 353, "veltliner": 801, "salad grüner": 616, "grüner veltliner": 354, "bacon": 40, "burger": 93, "assessment bacon": 17, "bacon burger": 41, "burger grenache": 96, "heavy": 357, "can": 111, "dominate": 256, "poultry": 538, "chicken": 172, "curry": 227, "heavy wine": 358, "wine can": 814, "can dominate": 112, "dominate poultry": 257, "poultry chicken": 539, "chicken curry": 173, "curry sangiovese": 236, "sweet": 738, "sparkling": 698, "pairs": 487, "with": 820, "dessert": 246, "sauternes": 654, "food sweet": 309, "sweet sparkling": 739, "sparkling pairs": 699, "pairs with": 488, "with dessert": 822, "dessert lemon": 249, "tart sauternes": 771, "cava": 126, "board cava": 55, "vegetable": 799, "assessment vegetable": 39, "vegetable curry": 800, "curry albariño": 228, "richer": 588, "body": 61, "matches": 423, "creamy": 222, "textures": 782, "alfredo": 12, "pasta": 489, "richer body": 589, "body matches": 62, "matches creamy": 424, "creamy textures": 224, "textures alfredo": 783, "alfredo pasta": 13, "pasta viognier": 497, "thai": 786, "riesling": 591, "dry": 258, "assessment thai": 38, "thai curry": 787, "curry riesling": 235, "riesling dry": 592, "chardonnay": 130, "burger chardonnay": 95, "lamb syrah": 402, "lighter": 415, "wines": 818, "fit": 270, "herbs": 359, "lighter wines": 416, "wines fit": 819, "fit poultry": 271, "poultry roast": 541, "roast chicken": 602, "chicken with": 174, "with herbs": 823, "herbs viognier": 365, "shrimp": 675, "scampi": 657, "seafood shrimp": 671, "shrimp scampi": 676, "scampi grüner": 662, "nebbiolo": 445, "curry nebbiolo": 233, "stir": 733, "fried": 313, "tofu": 788, "assessment stir": 37, "stir fried": 734, "fried tofu": 314, "tofu grüner": 790, "cheesecake": 162, "port": 537, "assessment cheesecake": 23, "cheesecake port": 167, "beef": 51, "stew": 703, "assessment beef": 19, "beef stew": 52, "stew cabernet": 706, "curry viognier": 240, "grilled": 349, "assessment grilled": 27, "grilled burger": 350, "burger cabernet": 94, "ice": 370, "herbs ice": 361, "ice wine": 371, "indian": 374, "vindaloo": 802, "gewürztraminer": 347, "assessment indian": 28, "indian vindaloo": 375, "vindaloo gewürztraminer": 803, "tofu pinot": 792, "merlot": 431, "burger merlot": 99, "mushroom": 442, "risotto": 593, "assessment mushroom": 31, "mushroom risotto": 443, "risotto sangiovese": 598, "champagne": 127, "scampi champagne": 660, "torrontés": 798, "curry torrontés": 239, "reds": 549, "clash": 179, "delicate": 243, "salmon": 635, "tannic reds": 762, "reds clash": 550, "clash with": 180, "with delicate": 821, "delicate seafood": 244, "seafood grilled": 669, "grilled salmon": 352, "salmon sauternes": 643, "mac": 419, "and": 14, "assessment mac": 29, "mac and": 420, "and cheese": 15, "cheese madeira": 144, "sorbet": 681, "dessert sorbet": 250, "sorbet ice": 684, "oysters ice": 480, "ribeye": 551, "grilled ribeye": 351, "ribeye nebbiolo": 567, "platter port": 521, "cream": 220, "of": 459, "soup": 689, "textures cream": 785, "cream of": 221, "of mushroom": 460, "mushroom soup": 444, "soup chardonnay": 691, "olives": 463, "assessment olives": 32, "olives and": 464, "cheese grenache": 141, "cheese gewürztraminer": 140, "curry ice": 232, "sichuan": 677, "noodles": 447, "assessment sichuan": 34, "sichuan noodles": 678, "noodles riesling": 450, "cheese sangiovese": 153, "bbq": 47, "brisket": 63, "fat bbq": 266, "bbq brisket": 48, "brisket cabernet": 66, "burger syrah": 102, "blanc": 53, "risotto sauvignon": 600, "sauvignon blanc": 656, "oysters cava": 476, "malbec": 422, "burger malbec": 98, "fondue": 274, "assessment fondue": 26, "fondue chardonnay": 280, "curry sauternes": 237, "herbs pinot": 362, "board ice": 58, "burger ice": 97, "idealized": 372, "perfect": 498, "example": 263, "for": 310, "contrast": 185, "idealized perfect": 373, "perfect pairing": 499, "pairing example": 486, "example for": 264, "for contrast": 311, "contrast grilled": 203, "platter chardonnay": 509, "fondue madeira": 287, "ribs": 581, "assessment bbq": 18, "bbq ribs": 49, "ribs syrah": 586, "cheese champagne": 136, "too": 796, "lean": 408, "dish": 252, "carbonara": 115, "too lean": 797, "lean for": 409, "for creamy": 312, "creamy dish": 223, "dish carbonara": 254, "carbonara nebbiolo": 122, "contrast citrus": 197, "brisket nebbiolo": 79, "zinfandel": 827, "ribs zinfandel": 587, "noodles gewürztraminer": 448, "cheese viognier": 159, "orange sauternes": 470, "dish cream": 255, "soup grenache": 692, "brisket malbec": 77, "fondue cabernet": 277, "curry pinot": 234, "sausage malbec": 650, "light": 412, "medium": 429, "pork": 533, "tenderloin": 774, "light medium": 413, "medium red": 430, "red suits": 548, "suits richer": 736, "richer poultry": 590, "poultry pork": 540, "pork pork": 535, "pork tenderloin": 536, "tenderloin grenache": 776, "table": 748, "clashes": 181, "sweetness": 740, "chocolate": 175, "mousse": 434, "dry table": 260, "table wine": 749, "wine clashes": 815, "clashes with": 182, "dessert sweetness": 251, "sweetness chocolate": 743, "chocolate mousse": 176, "mousse grüner": 436, "curry chardonnay": 229, "fondue port": 292, "curry gewürztraminer": 230, "tenderloin merlot": 778, "stew pinot": 720, "ribs malbec": 584, "ribs ice": 583, "ribeye cabernet": 554, "deliberately": 241, "bad": 42, "deliberately bad": 242, "bad pairing": 43, "contrast smoked": 215, "textures carbonara": 784, "carbonara chardonnay": 117, "carbonara merlot": 121, "mixed": 432, "nuts": 452, "assessment mixed": 30, "mixed nuts": 433, "nuts merlot": 457, "burger viognier": 103, "dessert chocolate": 248, "mousse sauternes": 440, "noodles nebbiolo": 449, "burger zinfandel": 104, "carbonara viognier": 125, "lamb malbec": 392, "assessment pork": 33, "tenderloin sauternes": 780, "salmon champagne": 638, "tofu sauternes": 794, "scampi sauvignon": 666, "cheese merlot": 146, "fish": 268, "tacos": 750, "seafood fish": 668, "fish tacos": 269, "tacos champagne": 753, "overwhelmed": 472, "by": 105, "delicate wine": 245, "wine overwhelmed": 816, "overwhelmed by": 473, "by red": 106, "meat roast": 428, "lamb riesling": 398, "caprese": 113, "assessment caprese": 20, "caprese salad": 114, "sausage zinfandel": 653, "risotto grüner": 595, "carbonara grenache": 118, "lamb nebbiolo": 394, "curry grüner": 231, "contrast oysters": 210, "stew malbec": 717, "risotto pinot": 597, "sweetness cheesecake": 742, "cheesecake albariño": 163, "platter merlot": 518, "dish alfredo": 253, "pasta sauvignon": 496, "salmon cava": 637, "stew nebbiolo": 719, "stew syrah": 727, "carbonara ice": 120, "barbera": 46, "cheese barbera": 133, "tacos sauternes": 758, "ribs cabernet": 582, "oysters champagne": 477, "off": 461, "calms": 109, "spice": 700, "off dry": 462, "dry sweetness": 259, "sweetness calms": 741, "calms spice": 110, "spice indian": 702, "vindaloo riesling": 805, "low": 417, "acid": 0, "seems": 672, "flabby": 272, "vs": 808, "acids": 7, "low acid": 418, "acid wine": 1, "wine seems": 817, "seems flabby": 673, "flabby vs": 273, "vs acids": 809, "acids lemon": 10, "tart port": 770, "contrast beef": 189, "assessment chocolate": 24, "mousse port": 439, "risotto sauternes": 599, "orange chardonnay": 466, "contrast mushroom": 208, "risotto ice": 596, "tofu sangiovese": 793, "cheese port": 150, "ribeye syrah": 575, "carbonara sauternes": 123, "burger sauternes": 101, "contrast cheese": 193, "platter sauternes": 525, "chenin": 170, "fondue chenin": 281, "chenin blanc": 171, "oysters sauvignon": 483, "brisket syrah": 87, "soup merlot": 694, "board merlot": 59, "pasta grenache": 492, "meat bbq": 426, "brisket champagne": 68, "provence": 542, "rosé": 604, "ribeye provence": 570, "provence rosé": 543, "ribeye malbec": 565, "noodles torrontés": 451, "ribs sauternes": 585, "gazpacho": 317, "food gazpacho": 307, "gazpacho sangiovese": 338, "burger nebbiolo": 100, "salad provence": 624, "fondue malbec": 288, "contrast shrimp": 213, "tenderloin viognier": 781, "pasta albariño": 490, "tofu ice": 791, "tacos albariño": 751, "scampi albariño": 658, "contrast sichuan": 214, "soup nebbiolo": 695, "herbs sauternes": 364, "salmon sauvignon": 644, "salmon albariño": 636, "tenderloin chardonnay": 775, "gamay": 315, "beaujolais": 50, "oysters gamay": 478, "gamay beaujolais": 316, "cheese cava": 135, "contrast indian": 204, "contrast pork": 211, "tempranillo": 773, "fondue tempranillo": 299, "gazpacho pinot": 334, "cheese chardonnay": 137, "tacos grüner": 755, "contrast bacon": 187, "sausage ice": 649, "scampi gamay": 661, "tart ice": 768, "platter viognier": 530, "platter champagne": 508, "pork duck": 534, "orange sangiovese": 469, "platter syrah": 527, "contrast vegetable": 219, "curry sauvignon": 238, "contrast gazpacho": 202, "oysters nebbiolo": 481, "oysters grüner": 479, "vindaloo torrontés": 806, "scampi cava": 659, "salad grenache": 615, "contrast thai": 218, "nuts grenache": 455, "sausage cabernet": 648, "dessert cheesecake": 247, "cheesecake ice": 165, "risotto albariño": 594, "mousse albariño": 435, "sorbet sauternes": 687, "tofu albariño": 789, "mousse madeira": 438, "cheesecake sauvignon": 169, "fondue torrontés": 300, "fondue sangiovese": 295, "herbs sangiovese": 363, "scampi nebbiolo": 664, "nuts champagne": 454, "stew sangiovese": 724, "lamb cava": 382, "platter ice": 515, "tacos cava": 752, "contrast mac": 206, "high": 368, "tannin": 763, "intensifies": 376, "heat": 355, "high tannin": 369, "tannin intensifies": 764, "intensifies spice": 377, "spice heat": 701, "heat indian": 356, "vindaloo nebbiolo": 804, "salad tempranillo": 630, "nuts cava": 453, "orange pinot": 468, "cheese sauternes": 154, "soup viognier": 697, "board champagne": 56, "tofu sauvignon": 795, "tacos gamay": 754, "pasta chardonnay": 491, "salmon ice": 641, "brisket gamay": 71, "salmon nebbiolo": 642, "brisket sangiovese": 84, "contrast carbonara": 191, "orange ice": 467, "scampi ice": 663, "assessment sorbet": 36, "sorbet port": 686, "fondue sauternes": 296, "contrast roast": 212, "herbs chardonnay": 360, "fondue viognier": 301, "acids citrus": 8, "salad gewürztraminer": 614, "sorbet madeira": 685, "platter gamay": 511, "tacos sauvignon": 759, "tenderloin nebbiolo": 779, "tacos nebbiolo": 757, "ribeye gamay": 559, "cheese zinfandel": 161, "contrast bbq": 188, "stew chenin": 710, "brisket riesling": 83, "platter cabernet": 506, "works": 825, "light red": 414, "red pinot": 547, "pinot with": 502, "with salmon": 824, "salmon works": 645, "works grilled": 826, "salmon gamay": 639, "contrast chicken": 195, "food dry": 306, "sweetness lemon": 744, "tart sauvignon": 772, "platter madeira": 516, "cheese albariño": 132, "cheese torrontés": 158, "fondue pinot": 291, "contrast alfredo": 186, "pasta merlot": 494, "contrast chocolate": 196, "cheesecake grüner": 164, "contrast duck": 199, "cheese malbec": 145, "contrast stir": 217, "tacos ice": 756, "ribeye cava": 555, "salad cava": 609, "contrast fish": 200, "cheesecake madeira": 166, "nuts ice": 456, "white": 810, "brisket white": 91, "white zinfandel": 811, "pasta grüner": 493, "contrast olives": 209, "stew white": 731, "soup sauvignon": 696, "oysters sauternes": 482, "tenderloin ice": 777, "fondue gewürztraminer": 283, "board sauternes": 60, "cheese ice": 143, "brisket grenache": 73, "contrast cheesecake": 194, "cheesecake sauternes": 168, "ribeye madeira": 564, "contrast charcuterie": 192, "carbonara albariño": 116, "salad white": 633, "cheese pinot": 148, "cheese cabernet": 134, "cheese provence": 151, "lamb albariño": 379, "ribeye barbera": 553, "mousse sauvignon": 441, "ribeye champagne": 556, "brisket cava": 67, "salad riesling": 625, "nuts sauternes": 458, "scampi sauternes": 665, "gazpacho cabernet": 320, "mousse ice": 437, "sweetness sorbet": 745, "sorbet sauvignon": 688, "salad cabernet": 608, "salad chenin": 612, "sausage sauternes": 651, "ribeye sauternes": 573, "stew chardonnay": 709, "ribeye zinfandel": 580, "salmon grüner": 640, "lamb grenache": 388, "ribeye port": 569, "brisket chenin": 70, "platter grenache": 513, "gazpacho madeira": 330, "brisket merlot": 78, "ribeye white": 579, "salad malbec": 619, "cheese tempranillo": 157, "lamb gamay": 386, "sorbet grüner": 683, "fondue grenache": 284, "brisket albariño": 64, "gazpacho sauvignon": 340, "fondue nebbiolo": 290, "contrast sorbet": 216, "platter chenin": 510, "brisket zinfandel": 92, "lamb sauternes": 400, "fondue albariño": 275, "carbonara grüner": 119, "contrast fondue": 201, "fondue provence": 293, "platter barbera": 505, "ribeye chardonnay": 557, "brisket chardonnay": 69, "lamb provence": 397, "platter grüner": 514, "contrast caprese": 190, "salad gamay": 613, "carbonara sauvignon": 124, "lamb tempranillo": 403, "lamb madeira": 391, "stew zinfandel": 732, "ribeye albariño": 552, "stew tempranillo": 728, "lamb viognier": 405, "soup grüner": 693, "platter cava": 507, "stew grenache": 713, "fondue grüner": 285, "brisket tempranillo": 88, "stew port": 721, "salad sauternes": 627, "platter riesling": 523, "contrast lemon": 205, "lamb champagne": 383, "salad ice": 617, "stew madeira": 716, "fondue ice": 286, "brisket pinot": 80, "stew torrontés": 729, "pasta nebbiolo": 495, "platter gewürztraminer": 512, "contrast cream": 198, "platter nebbiolo": 519, "stew gewürztraminer": 712, "lamb zinfandel": 407, "ribeye ice": 563, "platter zinfandel": 532, "lamb chenin": 385, "lamb ice": 390, "contrast mixed": 207, "stew barbera": 705, "lamb barbera": 380, "ribeye grüner": 562, "gazpacho chenin": 324, "ribeye tempranillo": 576, "platter provence": 522, "stew ice": 715, "tart albariño": 766, "salad viognier": 632, "stew cava": 707, "salad albariño": 606, "gazpacho syrah": 341, "fondue zinfandel": 303, "cheese grüner": 142, "tart grüner": 767, "salad merlot": 620, "brisket grüner": 74, "soup albariño": 690, "brisket sauvignon": 86, "gazpacho ice": 329, "lamb sangiovese": 399, "ribeye pinot": 568, "platter tempranillo": 528, "platter malbec": 517, "gazpacho merlot": 332, "fondue champagne": 279, "gazpacho nebbiolo": 333, "salad nebbiolo": 621, "salad port": 623, "fondue cava": 278, "salad barbera": 607, "brisket gewürztraminer": 72, "platter torrontés": 529, "acids gazpacho": 9, "gazpacho viognier": 344, "gazpacho white": 345, "gazpacho barbera": 319, "cheese syrah": 156, "brisket barbera": 65, "fondue sauvignon": 297, "stew albariño": 704, "gazpacho grüner": 328, "stew champagne": 708, "lamb port": 396, "platter albariño": 504, "ribeye sauvignon": 574, "ribeye riesling": 571, "cheese riesling": 152, "lamb torrontés": 404, "lamb pinot": 395, "lamb white": 406, "salad zinfandel": 634, "salad sauvignon": 628, "platter sangiovese": 524, "gazpacho riesling": 337, "gazpacho zinfandel": 346, "brisket madeira": 76, "stew provence": 722, "lamb gewürztraminer": 387, "brisket ice": 75, "ribeye grenache": 561, "fondue white": 302, "brisket torrontés": 89, "cheese white": 160, "stew viognier": 730, "fondue gamay": 282, "brisket port": 81, "lamb sauvignon": 401, "salad madeira": 618, "sorbet albariño": 682, "cheese chenin": 138, "ribeye chenin": 558, "stew grüner": 714, "gazpacho cava": 321, "gazpacho sauternes": 339, "salad torrontés": 631, "lamb grüner": 389, "fondue barbera": 276, "stew riesling": 723, "cheese sauvignon": 155, "fondue riesling": 294, "gazpacho torrontés": 343, "ribeye viognier": 578, "ribeye merlot": 566, "stew gamay": 711, "gazpacho gewürztraminer": 326, "gazpacho grenache": 327, "cheese gamay": 139, "fondue syrah": 298, "ribeye gewürztraminer": 560, "brisket sauternes": 85, "lamb chardonnay": 384, "brisket provence": 82, "lamb merlot": 393, "salad champagne": 610, "brisket viognier": 90, "platter white": 531, "gazpacho albariño": 318, "stew merlot": 718, "gazpacho malbec": 331, "salad chardonnay": 611, "stew sauternes": 725, "cheese nebbiolo": 147, "salad syrah": 629, "platter sauvignon": 526, "gazpacho gamay": 325, "gazpacho tempranillo": 342, "gazpacho port": 335, "ribeye sangiovese": 572, "stew sauvignon": 726, "fondue merlot": 289, "gazpacho chardonnay": 323, "gazpacho provence": 336, "gazpacho champagne": 322, "ribeye torrontés": 577}